Repository: chater-marzougui/Hrayer
Catalog: lib/l10n/app_*.arb
Languages: fr

source: Dashboard
fr: Tableau de bord

source: Chats
fr: Discussions

source: Profile
fr: Profil

source: Proofs
fr: Preuves

source: Settings
fr: Paramètres

source: Lands
fr: Terrains

source: Logout
fr: Se déconnecter

source: Cancel
fr: Annuler

source: Close
fr: Fermer

source: Conversations
fr: Les Conversations

source: Plant Disease ID
fr: Identification des maladies des plantes

source: Take photos of sick plants
fr: Prendre des photos de plantes malades pour diagnostic

source: Irrigation Advice
fr: Conseils d’irrigation

source: Watering schedules and techniques
fr: Horaires et techniques d’arrosage

source: Crop Care
fr: Entretien des cultures

# fertilizersSoilNutrition
source: Fertilizers, soil, and nutrition
fr: Engrais et nutrition du sol

source: Pest Control
fr: Lutte contre les parasites

source: Identify and treat plant pests
fr: Identifier et traiter les parasites des plantes

source: Weather Tips
fr: Conseils météo

source: Weather-based farming guidance
fr: Conseils agricoles basés sur la météo

source: Title
fr: Titre

source: Size
fr: Superficie

source: Crop
fr: Culture

source: Location
fr: Emplacement

source: Progress
fr: Progression

source: Voice
fr: Voix

source: An unexpected error occurred
fr: Une erreur inattendue s'est produite

source: Apply Changes
fr: Appliquer les changements

source: Are you sure you want to logout?
fr: Êtes-vous sûr de vouloir vous déconnecter ?

source: Change Password
fr: Changer le mot de passe

source: Choose an image source
fr: Choisissez une source d'image

source: Complete Profile
fr: Compléter le profil

source: Complete Your Profile
fr: Complétez votre profil

source: Confirm Password
fr: Confirmer le mot de passe

source: Contact Information
fr: Informations de contact

source: Contact Support
fr: Contacter le support

source: Create an Account
fr: Créer un compte

source: Current: {_selectedThemeMode}
fr: Actuel : {_selectedThemeMode}

source: Dart Template
fr: Modèle Dart

source: Don't have an account? Sign up
fr: Vous n'avez pas de compte ? S'inscrire

source: Edit Profile
fr: Modifier le profil

source: Email Address
fr: Adresse e-mail

source: Enable Notifications
fr: Activer les notifications

source: Enter the subject of your message
fr: Entrez le sujet de votre message

source: Enter your email
fr: Entrez votre e-mail

source: Enter your email to recover your password
fr: Entrez votre e-mail pour récupérer votre mot de passe

source: Enter your message
fr: Entrez votre message

source: Enter your name
fr: Entrez votre nom

source: Enter your password
fr: Entrez votre mot de passe

source: Error occurred during signup.
fr: Une erreur s'est produite lors de l'inscription.

# errorOccurredWhileUploadingTheImage
source: Error occurred while uploading the image: {e}
fr: Une erreur s'est produite lors du téléchargement de l'image : {e}

# errorPostingComment
source: Error posting comment: {e}
fr: Erreur lors de la publication du commentaire : {e}

# errorReauthenticatingUser
source: Error reauthenticating user: {e}
fr: Erreur de réauthentification de l'utilisateur : {e}

# errorSendingPasswordRecoveryEmail
source: Error sending password recovery email: {e}
fr: Erreur d'envoi de l'e-mail de récupération de mot de passe : {e}

source: Error signing out
fr: Erreur lors de la déconnexion

source: Error submitting support request
fr: Erreur lors de l'envoi de la demande de support

# errorUpdatingPassword
source: Error updating password: {e}
fr: Erreur de mise à jour du mot de passe : {e}

# errorUpdatingProfile
source: Error updating profile: {e}
fr: Erreur de mise à jour du profil : {e}

# errorSnapshotError
source: Error: {error}
fr: Erreur : {error}

# failedToCreateProfile
source: Failed to create profile: {toString}
fr: Échec de la création du profil : {toString}

source: Failed to upload image
fr: Échec du téléchargement de l'image

source: First Name
fr: Prénom

source: First name is required
fr: Le prénom est requis

source: Forgot Password?
fr: Mot de passe oublié ?

source: Gender is required
fr: Le genre est requis

source: Incorrect password
fr: Mot de passe incorrect

source: Invalid email address
fr: Adresse e-mail invalide

source: Last Name
fr: Nom de famille

source: Last name is required
fr: Le nom de famille est requis

source: Login failed
fr: Échec de la connexion

# loginFailedWithMessage
source: Login failed: {message}
fr: Échec de la connexion : {message}

source: New Password
fr: Nouveau mot de passe

source: No account found with this email
fr: Aucun compte trouvé avec cet e-mail

source: No comments yet
fr: Aucun commentaire pour l'instant

source: Old Password
fr: Ancien mot de passe

source: Or continue with
fr: Ou continuer avec

# passwordRequirements
source: Password must be at least 8 characters long and contain a number
fr: Le mot de passe doit comporter au moins 8 caractères et contenir un chiffre

source: Password updated successfully
fr: Mot de passe mis à jour avec succès

source: Passwords do not match
fr: Les mots de passe ne correspondent pas

# passwordsDoNotMatchExclamation
source: Passwords do not match!
fr: Les mots de passe ne correspondent pas !

source: Personal Account
fr: Compte personnel

source: Phone Number
fr: Numéro de téléphone

source: Phone number is required
fr: Le numéro de téléphone est requis

source: Please confirm your password
fr: Veuillez confirmer votre mot de passe

source: Please enter {label}
fr: Veuillez entrer {label}

source: Please enter a password
fr: Veuillez entrer un mot de passe

source: Please enter a valid email address
fr: Veuillez entrer une adresse e-mail valide

source: Please enter a valid phone number
fr: Veuillez entrer un numéro de téléphone valide

source: Please enter your email
fr: Veuillez entrer votre e-mail

source: Please enter your first name
fr: Veuillez entrer votre prénom

source: Please enter your last name
fr: Veuillez entrer votre nom de famille

source: Please fill in all fields
fr: Veuillez remplir tous les champs

source: Please select your birthdate
fr: Veuillez sélectionner votre date de naissance

source: Please select your gender
fr: Veuillez sélectionner votre genre

source: Posted by
fr: Publié par

source: Profile updated successfully
fr: Profil mis à jour avec succès

source: Random text
fr: Texte aléatoire

source: Recover Password
fr: Récupérer le mot de passe

source: Select Your Birthdate
fr: Sélectionnez votre date de naissance

source: Sign In
fr: Se connecter

source: Sign in to continue your journey
fr: Connectez-vous pour continuer votre voyage

source: Sign Up
fr: S'inscrire

source: Signing in...
fr: Connexion en cours...

source: Submit Request
fr: Envoyer la demande

source: Support request submitted successfully
fr: Demande de support envoyée avec succès

source: Tap again to exit
fr: Appuyez à nouveau pour quitter

source: Text on Button
fr: Texte sur le bouton

source: Theme Mode
fr: Mode du thème

source: This account has been disabled
fr: Ce compte a été désactivé

source: This page is a place holder
fr: Cette page est un espace réservé

# tooManyFailedAttempts
source: Too many failed attempts. Please try again later
fr: Trop de tentatives échouées. Veuillez réessayer plus tard

source: Type your old password and the new one to apply changes
fr: Saisissez votre ancien mot de passe et le nouveau pour appliquer les changements

source: Type your password to apply changes
fr: Saisissez votre mot de passe pour appliquer les changements

source: Unknown User
fr: Utilisateur inconnu

source: User not logged in
fr: Utilisateur non connecté

# weNeedAFewMoreDetails
source: We need a few more details to get you started
fr: Nous avons besoin de quelques détails supplémentaires pour vous lancer

source: Welcome Back!
fr: Content de vous revoir !

source: Would you like to take a picture or choose from gallery?
fr: Voulez-vous prendre une photo ou choisir dans la galerie ?

source: Write a comment...
fr: Écrire un commentaire...

source: Wrong password
fr: Mauvais mot de passe

source: You can interact with me in multiple ways:
fr: Vous pouvez interagir avec moi de plusieurs manières :

source: 👋 Hi there! I'm B-BOT
fr: 👋 Salut ! Je suis B-BOT

source: Camera
fr: Caméra

source: Gallery
fr: Galerie

# farmerRoleDescription
source: • Can add and manage lands • Can upload progress proofs • Can chat with sponsors • Can add new users (admin privileges)
fr: • Peut ajouter et gérer des terres • Peut télécharger des preuves de progression • Peut discuter avec les sponsors • Peut ajouter de nouveaux utilisateurs (privilèges d'administrateur)

# sponsorRoleDescription
source: • Can browse and sponsor projects • Can chat with farmers • Can view progress updates
fr: • Peut parcourir et sponsoriser des projets • Peut discuter avec les agriculteurs • Peut voir les mises à jour de progression

# userWithPhoneNumberExists
source: A user with this phone number already exists
fr: Un utilisateur avec ce numéro de téléphone existe déjà

source: Active Lands
fr: Terres Actives

source: Active Projects
fr: Projets Actifs

source: Active Sponsor
fr: Sponsor Actif

source: Add Land
fr: Ajouter une Terre

source: Add New User
fr: Ajouter un Nouvel Utilisateur

source: Add Photos (Max 8)
fr: Ajouter des Photos (Max 8)

source: Add Progress Photos (Max 3)
fr: Ajouter des Photos de Progression (Max 3)

source: Add User
fr: Ajouter un Utilisateur

source: Add Your First Farm
fr: Ajoutez Votre Première Ferme

source: Add Your First Land
fr: Ajoutez Votre Première Terre

# addYourFirstLandToStart
source: Add your first land to start seeking sponsorship
fr: Ajoutez votre première terre pour commencer à chercher des sponsors

source: AI Assistant
fr: Assistant IA

source: AI Chat
fr: Chat IA

source: Almost Complete (75-99%)
fr: Presque Terminé (75-99%)

source: ALMOST THERE
fr: PRESQUE FINI

source: Amount must be greater than 0
fr: Le montant doit être supérieur à 0

source: Amount Raised
fr: Montant Collecté

source: Apply Filters
fr: Appliquer les Filtres

# asAFarmerYouCanInvite
source: As a farmer (admin), you can invite new users to join the platform
fr: En tant qu'agriculteur (admin), vous pouvez inviter de nouveaux utilisateurs à rejoindre la plateforme

source: Basic Information
fr: Informations de Base

# browseProjectsAndMakeADifference
source: Browse available projects and start making a difference in rural farming communities
fr: Parcourez les projets disponibles et commencez à faire une différence dans les communautés agricoles rurales

source: Browse Projects
fr: Parcourir les Projets

source: Clear Filters
fr: Effacer les Filtres

# appTagline
source: Connecting women farmers with investors for sustainable agriculture
fr: Connecter les agricultrices avec des investisseurs pour une agriculture durable

source: Continue as User
fr: Continuer en tant qu'Utilisateur

# describeCurrentProgress
source: Describe the current progress, any challenges, achievements, or observations...
fr: Décrivez la progression actuelle, les défis, les réussites ou les observations...

# describeYourLand
source: Describe your land, soil type, current condition...
fr: Décrivez votre terre, le type de sol, l'état actuel...

# discoverFarmingOpportunities
source: Discover farming opportunities and support sustainable agriculture
fr: Découvrez des opportunités agricoles et soutenez l'agriculture durable

source: Due Soon
fr: Bientôt Échéant

source: Email (Optional)
fr: Email (Optionnel)

source: Enter size
fr: Entrez la taille

source: Enter valid amount
fr: Entrez un montant valide

# errorLoadingLands
source: Error loading lands: {e}
fr: Erreur de chargement des terres : {e}

source: Error loading messages
fr: Erreur de chargement des messages

# errorLoadingMessagesWithDetails
source: Error loading messages: {error}
fr: Erreur de chargement des messages : {error}

# errorLoadingProjects
source: Error loading projects: {e}
fr: Erreur de chargement des projets : {e}

# errorLoadingSponsoredLands
source: Error loading sponsored lands: {e}
fr: Erreur de chargement des terres sponsorisées : {e}

# errorLoadingSponsorships
source: Error loading sponsorships: {e}
fr: Erreur de chargement des sponsorings : {e}

# errorLoadingUpdates
source: Error loading updates: {e}
fr: Erreur de chargement des mises à jour : {e}

# errorLoadingYourLands
source: Error loading your lands: {e}
fr: Erreur de chargement de vos terres : {e}

# errorOccurredWhileUploadingImage
source: Error occurred while uploading the image: {e}
fr: Une erreur est survenue lors du téléchargement de l'image : {e}

# errorPickingImages
source: Error picking images: {e}
fr: Erreur lors de la sélection des images : {e}

# errorProcessingSponsorship
source: Error processing sponsorship: {e}
fr: Erreur lors du traitement du sponsoring : {e}

# errorGeneric
source: Error: {e}
fr: Erreur : {e}

source: Failed to load image
fr: Échec du chargement de l'image

# failedToSendMessage
source: Failed to send message: {e}
fr: Échec de l'envoi du message : {e}

# failedToUpdateRole
source: Failed to update role: {toString}
fr: Échec de la mise à jour du rôle : {toString}

source: Failed to upload image after multiple attempts
fr: Échec du téléchargement de l'image après plusieurs tentatives

source: Farmer Role:
fr: Rôle Agriculteur :

source: Farmers Helped
fr: Agriculteurs Aidés

source: Filter by Crop
fr: Filtrer par Culture

source: Filter by Funding Status
fr: Filtrer par Statut de Financement

source: Filter Projects
fr: Filtrer les Projets

source: Find Projects to Support
fr: Trouver des Projets à Soutenir

source: Full Name
fr: Nom Complet

source: Fully Funded
fr: Entièrement Financé

source: Funding Breakdown
fr: Répartition du Financement

source: Funding Needs (TND)
fr: Besoins de Financement (TND)

source: Funding Progress
fr: Progression du Financement

# helpLandReachFundingGoal
source: Help {title} reach its funding goal!
fr: Aidez {title} à atteindre son objectif de financement !

# helpProjectReachFundingGoal
source: Help this project reach its funding goal!
fr: Aidez ce projet à atteindre son objectif de financement !

source: I'm a Farmer
fr: Je suis un Agriculteur

source: I'm an Investor
fr: Je suis un Investisseur

source: IN PROGRESS
fr: EN COURS

source: In Progress (25-75%)
fr: En Cours (25-75%)

# intendedCropRequired
source: Intended Crop *
fr: Culture Prévue *

source: Invalid number
fr: Numéro invalide

source: Join Chat
fr: Rejoindre la Discussion

source: Just Started (0-25%)
fr: Vient de Commencer (0-25%)

source: Land Images
fr: Images de la Terre

source: Land Information
fr: Informations sur la Terre

source: Land registered successfully!
fr: Terre enregistrée avec succès !

# landTitleRequired
source: Land Title *
fr: Titre de la Terre *

# loadedLandsCount
source: Loaded {length} lands
fr: {length} terres chargées

# locationRequired
source: Location *
fr: Emplacement *

source: Maximum 3 images allowed for updates
fr: Maximum 3 images autorisées pour les mises à jour

source: Maximum 8 images allowed
fr: Maximum 8 images autorisées

source: My Farm Dashboard
fr: Tableau de Bord de ma Ferme

source: My Lands
fr: Mes Terres

source: My Sponsorships
fr: Mes Sponsorings

# nameMustBeAtLeast2Chars
source: Name must be at least 2 characters long
fr: Le nom doit contenir au moins 2 caractères

source: No Active Conversations
fr: Aucune Conversation Active

source: No authenticated user
fr: Aucun utilisateur authentifié

source: No Conversations Available
fr: Aucune Conversation Disponible

source: No Farms to Upload Proof
fr: Aucune Ferme pour Télécharger une Preuve

source: No lands registered yet
fr: Aucune terre enregistrée pour le moment

source: No messages yet
fr: Aucun message pour l'instant

source: No photos available
fr: Aucune photo disponible

source: No projects found
fr: Aucun projet trouvé

source: No sponsorships yet
fr: Aucun sponsoring pour le moment

source: No updates
fr: Aucune mise à jour

source: No updates yet
fr: Aucune mise à jour pour le moment

# onlyAdminsCanAddUsers
source: Only farmers (admins) can add new users
fr: Seuls les agriculteurs (admins) peuvent ajouter de nouveaux utilisateurs

# onlyAdminsCanAddUsersPlatform
source: Only farmers (admins) can add new users to the platform
fr: Seuls les agriculteurs (admins) peuvent ajouter de nouveaux utilisateurs à la plateforme

source: Please add at least one image
fr: Veuillez ajouter au moins une image

source: Please add at least one photo
fr: Veuillez ajouter au moins une photo

# pleaseEnterDescription
source: Please enter a description
fr: Veuillez entrer une description

# pleaseEnterPhoneNumber
source: Please enter a phone number
fr: Veuillez entrer un numéro de téléphone

# pleaseEnterLandTitle
source: Please enter a title for your land
fr: Veuillez entrer un titre pour votre terre

source: Please enter location
fr: Veuillez entrer un emplacement

# pleaseEnterTheUser
source: Please enter the user's name
fr: Veuillez entrer le nom de l'utilisateur

# pleaseProvideDetailedUpdate
source: Please provide a more detailed update (at least 10 characters)
fr: Veuillez fournir une mise à jour plus détaillée (au moins 10 caractères)

# pleaseProvideProgressUpdateNote
source: Please provide a progress update note
fr: Veuillez fournir une note de mise à jour

# pleaseSpecifyFundingNeed
source: Please specify at least one funding need
fr: Veuillez spécifier au moins un besoin de financement

# pleaseSpecifyCrop
source: Please specify the crop you plan to grow
fr: Veuillez spécifier la culture que vous prévoyez de faire pousser

source: Progress Note
fr: Note de Progression

source: Progress Photos
fr: Photos de Progression

source: Project Chat
fr: Discussion du Projet

source: Project Details
fr: Détails du Projet

source: Project Information
fr: Informations sur le Projet

source: Project Name
fr: Nom du Projet

source: Project Updates
fr: Mises à Jour du Projet

source: Projects Completed
fr: Projets Terminés

# projectsYouSupportCount
source: Projects You Support ({length})
fr: Projets que Vous Soutenez ({length})

source: Quick Actions
fr: Actions Rapides

source: Quick amounts:
fr: Montants rapides :

source: Recent Updates
fr: Mises à Jour Récentes

source: Register Land
fr: Enregistrer une Terre

source: Register New Land
fr: Enregistrer une Nouvelle Terre

# remainingNeeded
source: Remaining needed: TND {remainingAmount}
fr: Reste nécessaire : TND {remainingAmount}

# searchProjects
source: Search projects by name, location, or crop...
fr: Rechercher des projets par nom, lieu ou culture...

source: SEEKING FUNDING
fr: EN RECHERCHE DE FINANCEMENT

# selectFarmToUploadProof
source: Select a farm to upload progress proof and keep your sponsors updated
fr: Sélectionnez une ferme pour télécharger une preuve de progression et tenir vos sponsors informés

# selectProjectToChat
source: Select a project to start or continue conversation with the farmer and other sponsors
fr: Sélectionnez un projet pour commencer ou continuer la conversation avec l'agriculteur et les autres sponsors

source: Select Conversation
fr: Sélectionner la Conversation

source: Select Farm
fr: Sélectionner la Ferme

source: Send encouragement or ask questions...
fr: Envoyez des encouragements ou posez des questions...

source: Send Invitation
fr: Envoyer une Invitation

source: Sending Invitation...
fr: Envoi de l'invitation...

# shareAnUpdateWithSponsors
source: Share an update with your sponsors...
fr: Partagez une mise à jour avec vos sponsors...

# shareLandOpportunities
source: Share your land opportunities and connect with investors to grow your farming business
fr: Partagez vos opportunités foncières et connectez-vous avec des investisseurs pour développer votre entreprise agricole

# sizeInHectaresRequired
source: Size (hectares) *
fr: Taille (hectares) *

# specifyFundingNeeds
source: Specify how much funding you need for each category
fr: Spécifiez le montant du financement dont vous avez besoin pour chaque catégorie

# sponsorLandTitle
source: Sponsor {title}
fr: Sponsoriser {title}

source: Sponsor Dashboard
fr: Tableau de Bord du Sponsor

source: Sponsor Now
fr: Sponsoriser Maintenant

source: Sponsor Project
fr: Sponsoriser le Projet

source: Sponsor Role:
fr: Rôle Sponsor :

# sponsorshipAmountUsd
source: Sponsorship Amount ($)
fr: Montant du Sponsoring ($)

source: Sponsorship Amount (TND)
fr: Montant du Sponsoring (TND)

# startConversationWithSponsors
source: Start a conversation with your sponsors
fr: Commencez une conversation avec vos sponsors

# startTheConversation
source: Start the conversation! Share updates, ask questions, or offer support.
fr: Commencez la conversation ! Partagez des mises à jour, posez des questions ou offrez votre soutien.

source: Submit Update
fr: Soumettre la Mise à Jour

source: Tap to chat
fr: Appuyez pour discuter

source: Tap to upload progress proof
fr: Appuyez pour télécharger la preuve de progression

# thankYouForSupporting
source: Thank you for supporting sustainable agriculture and empowering rural farmers! 🌱
fr: Merci de soutenir l'agriculture durable et d'autonomiser les agriculteurs ruraux ! 🌱

# thankYouForSponsorship
source: Thank you for your sponsorship!
fr: Merci pour votre sponsoring !

# farmerWillPostUpdatesHere
source: The farmer will post progress updates here
fr: L'agriculteur publiera les mises à jour de progression ici

# transparentGroupChatDisclaimer
source: This is a transparent group chat. All messages are visible to project participants for safety and accountability.
fr: Ceci est une discussion de groupe transparente. Tous les messages sont visibles par les participants au projet pour la sécurité et la responsabilité.

# tipShareProgress
source: Tip: Share progress photos and updates to keep everyone engaged!
fr: Astuce : Partagez des photos et des mises à jour de progression pour maintenir l'engagement de tous !

source: Total Contributed
fr: Total Contribué

source: Total Funding
fr: Financement Total

source: Total Hectares
fr: Hectares Totaux

source: Total Lands
fr: Terres Totales

source: Total Needed
fr: Total Nécessaire

source: Total Raised
fr: Total Collecté

# tryAdjustingSearch
source: Try adjusting your search criteria
fr: Essayez d'ajuster vos critères de recherche

source: Type a message...
fr: Écrire un message...

source: Unknown Farmer
fr: Agriculteur Inconnu

source: Update submitted successfully!
fr: Mise à jour soumise avec succès !

source: Update Type
fr: Type de Mise à Jour

source: User Information
fr: Informations Utilisateur

source: View Details
fr: Voir les Détails

source: Weather feature coming soon!
fr: Fonctionnalité météo bientôt disponible !

source: Weekly updates recommended
fr: Mises à jour hebdomadaires recommandées

# youNeedAdminPrivileges
source: You need farmer (admin) privileges to add new users
fr: Vous avez besoin des privilèges d'agriculteur (admin) pour ajouter de nouveaux utilisateurs

# youNeedActiveFarmsToUpload
source: You need to have active farms to upload progress proofs.
fr: Vous devez avoir des fermes actives pour télécharger des preuves de progression.

# youNeedActiveLandsToChat
source: You need to have active lands with sponsors to start conversations.
fr: Vous devez avoir des terres actives avec des sponsors pour démarrer des conversations.

# youNeedToSponsorToChat
source: You need to sponsor projects to start conversations with farmers.
fr: Vous devez sponsoriser des projets pour démarrer des conversations avec les agriculteurs.

# yourFarmsCount
source: Your Farms ({length})
fr: Vos Fermes ({length})

source: Your Impact
fr: Votre Impact

# newSponsorJoinedUsd
source: 🎉 New sponsor joined! A generous contribution of ${amount} has been made to support this project.
fr: 🎉 Nouveau sponsor a rejoint ! Une contribution généreuse de ${amount} a été faite pour soutenir ce projet.
