Repository: chater-marzougui/Hrayer
Catalog: lib/l10n/app_*.arb
Languages: fr

# newSponsorJoinedTnd
source: 🎉 New sponsor joined! A generous contribution of TND{amount} has been made to support this project.
fr: 🎉 Nouveau sponsor a rejoint ! Une contribution généreuse de TND{amount} a été faite pour soutenir ce projet

# fundedPercentage
source: {percentage}% funded
fr: {percentage}% financé

source: Loading weather...
fr: Chargement météo...

# weatherError
source: Unable to load weather data
fr: Impossible de charger les données météo

source: Retry
fr: Réessayer

source: Current Location
fr: Position actuelle

source: Temperature
fr: Température

source: Humidity
fr: Humidité

source: Wind
fr: Vent

source: Precipitation
fr: Précipitations

source: Sunrise
fr: Lever du soleil

source: Sunset
fr: Coucher du soleil
